Pandas Series is a NumPy array with extra features

In [1]:
import numpy as np
import pandas as pd

In [2]:
sales=[0,5,155,0,518,1827,616,317,325]

In [3]:
sales_series=pd.Series(sales,name="Sales")
sales_series

0       0
1       5
2     155
3       0
4     518
5    1827
6     616
7     317
8     325
Name: Sales, dtype: int64

In [4]:
array=np.arange(5)
series=pd.Series(array,name="Test Array")
series

0    0
1    1
2    2
3    3
4    4
Name: Test Array, dtype: int32

In [5]:
series.values.mean()

2.0

In [6]:
series.mean()

2.0

In [7]:
series.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
series.index=[10,20,30,40,50]

In [9]:
series

10    0
20    1
30    2
40    3
50    4
Name: Test Array, dtype: int32

In [10]:
series.name="Nahhh"
series

10    0
20    1
30    2
40    3
50    4
Name: Nahhh, dtype: int32

In [11]:
sales_series.astype("float")

0       0.0
1       5.0
2     155.0
3       0.0
4     518.0
5    1827.0
6     616.0
7     317.0
8     325.0
Name: Sales, dtype: float64

In [12]:
sales_series.astype("string")

0       0
1       5
2     155
3       0
4     518
5    1827
6     616
7     317
8     325
Name: Sales, dtype: string

In [13]:
sales_series.astype("int")

0       0
1       5
2     155
3       0
4     518
5    1827
6     616
7     317
8     325
Name: Sales, dtype: int32

In [14]:
sales_series.mean()

418.1111111111111

In [15]:
sales_series.median()

317.0

In [16]:
items=["Coffee","Latte","Ice","Tea","Juice","Candy","Drinks","Chips","Ketchup"]

In [17]:
sales_series.index=items
sales_series

Coffee        0
Latte         5
Ice         155
Tea           0
Juice       518
Candy      1827
Drinks      616
Chips       317
Ketchup     325
Name: Sales, dtype: int64

In [18]:
sales_series["Candy":"Chips"]

Candy     1827
Drinks     616
Chips      317
Name: Sales, dtype: int64

In [19]:
sales_series.index=range(9)

In [20]:
sales_series

0       0
1       5
2     155
3       0
4     518
5    1827
6     616
7     317
8     325
Name: Sales, dtype: int64

In [21]:
sales_series.iloc[[1,2,7]]

1      5
2    155
7    317
Name: Sales, dtype: int64

In [22]:
sales_series.index=["Coffee","Latte","Ice","Tea","Juice","Candy","Drinks","Chips","Ketchup"]

In [23]:
sales_series.loc["Latte":"Juice"]

Latte      5
Ice      155
Tea        0
Juice    518
Name: Sales, dtype: int64

In [24]:
sales_series.reset_index(drop=True)
sales_series

Coffee        0
Latte         5
Ice         155
Tea           0
Juice       518
Candy      1827
Drinks      616
Chips       317
Ketchup     325
Name: Sales, dtype: int64

In [50]:
team=pd.DataFrame({"Name":["Nafeax","Nexy","Lingesh","Pewdiepie"],"Age":[19,19,19,19]})
team

        Name  Age
0     Nafeax   19
1       Nexy   19
2    Lingesh   19
3  Pewdiepie   19

In [51]:
team.iloc[2:,:]

        Name  Age
2    Lingesh   19
3  Pewdiepie   19

In [52]:
team.loc[2:,"Name"]

2      Lingesh
3    Pewdiepie
Name: Name, dtype: object

In [28]:
sales_series.loc[sales_series>0]

Latte         5
Ice         155
Juice       518
Candy      1827
Drinks      616
Chips       317
Ketchup     325
Name: Sales, dtype: int64

In [29]:
sales_series.eq(0)

Coffee      True
Latte      False
Ice        False
Tea         True
Juice      False
Candy      False
Drinks     False
Chips      False
Ketchup    False
Name: Sales, dtype: bool

In [30]:
sales_series.gt(1000)

Coffee     False
Latte      False
Ice        False
Tea        False
Juice      False
Candy       True
Drinks     False
Chips      False
Ketchup    False
Name: Sales, dtype: bool

In [31]:
sales_series.isin([5])

Coffee     False
Latte       True
Ice        False
Tea        False
Juice      False
Candy      False
Drinks     False
Chips      False
Ketchup    False
Name: Sales, dtype: bool

In [32]:
sales_series.sort_values()

Coffee        0
Tea           0
Latte         5
Ice         155
Chips       317
Ketchup     325
Juice       518
Drinks      616
Candy      1827
Name: Sales, dtype: int64

In [33]:
sales_series.sort_values(ascending=False)

Candy      1827
Drinks      616
Juice       518
Ketchup     325
Chips       317
Ice         155
Latte         5
Coffee        0
Tea           0
Name: Sales, dtype: int64

In [34]:
sales_series.isin([1,2])

Coffee     False
Latte      False
Ice        False
Tea        False
Juice      False
Candy      False
Drinks     False
Chips      False
Ketchup    False
Name: Sales, dtype: bool

In [35]:
transaction=pd.read_csv("transactions.csv")
transaction_series=pd.Series(transaction["transactions"])
transaction_series.head()

0     770
1    2111
2    2358
3    3487
4    1922
Name: transactions, dtype: int64

In [36]:
transaction_series.quantile([0.25,0.50,0.75,0.95,0.99],interpolation="nearest")

0.25    1046
0.50    1393
0.75    2079
0.95    3712
0.99    4862
Name: transactions, dtype: int64

In [37]:
transaction_series.max()

8359

In [38]:
sales_series

Coffee        0
Latte         5
Ice         155
Tea           0
Juice       518
Candy      1827
Drinks      616
Chips       317
Ketchup     325
Name: Sales, dtype: int64

In [39]:
sales_series.unique()

array([   0,    5,  155,  518, 1827,  616,  317,  325], dtype=int64)

In [40]:
sales_series.nunique()

8

In [41]:
sales_series.value_counts(normalize=True)

0       0.222222
5       0.111111
155     0.111111
518     0.111111
1827    0.111111
616     0.111111
317     0.111111
325     0.111111
Name: Sales, dtype: float64

In [42]:
sales=[1,90,2,45,78,np.nan,89]
sales1=pd.Series(sales,name="Sales")
sales1

0     1.0
1    90.0
2     2.0
3    45.0
4    78.0
5     NaN
6    89.0
Name: Sales, dtype: float64

In [43]:
sales1.isna()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
Name: Sales, dtype: bool

In [44]:
sales1.value_counts(dropna=False)

1.0     1
90.0    1
2.0     1
45.0    1
78.0    1
NaN     1
89.0    1
Name: Sales, dtype: int64

In [45]:
sales1.dropna(inplace=True)
sales1.reset_index(drop=True)

0     1.0
1    90.0
2     2.0
3    45.0
4    78.0
5    89.0
Name: Sales, dtype: float64

In [46]:
def fuc(price):
    if price>50:
        return round(price*0.80,2)
    else:
        return price

In [47]:
sales1.apply(lambda x: round(x*0.80) if x>50 else x)

0     1.0
1    72.0
2     2.0
3    45.0
4    62.0
6    71.0
Name: Sales, dtype: float64

In [53]:
pd.DataFrame({"ID":[1,2],"Name":["Lingesh","Pewdiepie"]})

   ID       Name
0   1    Lingesh
1   2  Pewdiepie

In [54]:
df=pd.read_csv("transactions.csv")
df.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [55]:
df.tail()

             date  store_nbr  transactions
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [58]:
df.sample(5)

             date  store_nbr  transactions
72158  2017-01-16         25           819
33291  2014-12-15         14          1730
56136  2016-03-14         38          1354
20369  2014-03-16         34          2507
54906  2016-02-20         27          1642

In [67]:
df.describe(include="all")

              date     store_nbr  transactions
count        83488  83488.000000  83488.000000
unique        1682           NaN           NaN
top     2017-08-15           NaN           NaN
freq            54           NaN           NaN
mean           NaN     26.939237   1694.602158
std            NaN     15.608204    963.286644
min            NaN      1.000000      5.000000
25%            NaN     13.000000   1046.000000
50%            NaN     27.000000   1393.000000
75%            NaN     40.000000   2079.000000
max            NaN     54.000000   8359.000000

In [71]:
df[["date","store_nbr"]]

             date  store_nbr
0      2013-01-01         25
1      2013-01-02          1
2      2013-01-02          2
3      2013-01-02          3
4      2013-01-02          4
...           ...        ...
83483  2017-08-15         50
83484  2017-08-15         51
83485  2017-08-15         52
83486  2017-08-15         53
83487  2017-08-15         54

[83488 rows x 2 columns]

In [70]:
df.store_nbr

0        25
1         1
2         2
3         3
4         4
         ..
83483    50
83484    51
83485    52
83486    53
83487    54
Name: store_nbr, Length: 83488, dtype: int64

In [72]:
df["date"].nunique()

1682

In [73]:
df["date"].value_counts()

2017-08-15    54
2017-06-02    54
2017-05-21    54
2017-05-22    54
2017-05-23    54
              ..
2016-01-04    14
2014-01-01     2
2017-01-01     1
2015-01-01     1
2013-01-01     1
Name: date, Length: 1682, dtype: int64

In [74]:
df.columns

Index(['date', 'store_nbr', 'transactions'], dtype='object')

In [75]:
df.columns=["Date","Store","Transactions"]

In [79]:
df.columns

Index(['Date', 'Store', 'Transactions'], dtype='object')

In [87]:
df.iloc[3:,:2]

             Date  Store
3      2013-01-02      3
4      2013-01-02      4
5      2013-01-02      5
6      2013-01-02      6
7      2013-01-02      7
...           ...    ...
83483  2017-08-15     50
83484  2017-08-15     51
83485  2017-08-15     52
83486  2017-08-15     53
83487  2017-08-15     54

[83485 rows x 2 columns]

In [91]:
df.loc[5:,["Date","Transactions"]]

             Date  Transactions
5      2013-01-02          1903
6      2013-01-02          2143
7      2013-01-02          1874
8      2013-01-02          3250
9      2013-01-02          2940
...           ...           ...
83483  2017-08-15          2804
83484  2017-08-15          1573
83485  2017-08-15          2255
83486  2017-08-15           932
83487  2017-08-15           802

[83483 rows x 2 columns]

In [96]:
df.head()

         Date  Store  Transactions
0  2013-01-01     25           770
1  2013-01-02      1          2111
2  2013-01-02      2          2358
3  2013-01-02      3          3487
4  2013-01-02      4          1922

In [97]:
df.loc[:,["Store","Transactions"]]

       Store  Transactions
0         25           770
1          1          2111
2          2          2358
3          3          3487
4          4          1922
...      ...           ...
83483     50          2804
83484     51          1573
83485     52          2255
83486     53           932
83487     54           802

[83488 rows x 2 columns]

In [103]:
df.loc[:,["Store","Transactions"]].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Store         83488 non-null  int64
 1   Transactions  83488 non-null  int64
dtypes: int64(2)
memory usage: 1.3 MB

In [104]:
df.drop("Date",axis=1).head()

   Store  Transactions
0     25           770
1      1          2111
2      2          2358
3      3          3487
4      4          1922

In [106]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          83488 non-null  object
 1   Store         83488 non-null  int64
 2   Transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [112]:
df.drop(range(1,100,2),axis=0).head()

         Date  Store  Transactions
0  2013-01-01     25           770
2  2013-01-02      2          2358
4  2013-01-02      4          1922
6  2013-01-02      6          2143
8  2013-01-02      8          3250

In [130]:
df.duplicated(subset="Date").value_counts()

True     81806
False     1682
dtype: int64

In [128]:
df.drop_duplicates(subset="Date")

Date        Store  Transactions
2013-01-01  25     770             1
2016-01-15  1      1872            1
2016-02-08  1      417             1
2016-02-07  1      401             1
2016-02-06  1      1190            1
                                  ..
2014-07-13  1      538             1
2014-07-12  1      1211            1
2014-07-11  1      1802            1
2014-07-10  1      1665            1
2017-08-15  1      1693            1
Length: 1682, dtype: int64

In [124]:
df.drop_duplicates(subset="Date",keep="last",ignore_index=True)

            Date  Store  Transactions
0     2013-01-01     25           770
1     2013-01-02     54           998
2     2013-01-03     54           920
3     2013-01-04     54           794
4     2013-01-05     54           949
...          ...    ...           ...
1677  2017-08-11     54           768
1678  2017-08-12     54           903
1679  2017-08-13     54          1054
1680  2017-08-14     54           818
1681  2017-08-15     54           802

[1682 rows x 3 columns]

In [126]:
df.drop_duplicates(subset="Date",keep="last",ignore_index=True)

Date        Store  Transactions
2013-01-01  25     770             1
2016-01-15  54     764             1
2016-02-08  54     748             1
2016-02-07  54     990             1
2016-02-06  54     1007            1
                                  ..
2014-07-13  54     1062            1
2014-07-12  54     949             1
2014-07-11  54     753             1
2014-07-10  54     750             1
2017-08-15  54     802             1
Length: 1682, dtype: int64

In [131]:
df.isna().sum()

Date            0
Store           0
Transactions    0
dtype: int64

In [133]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          83488 non-null  object
 1   Store         83488 non-null  int64
 2   Transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [134]:
df.describe()

              Store  Transactions
count  83488.000000  83488.000000
mean      26.939237   1694.602158
std       15.608204    963.286644
min        1.000000      5.000000
25%       13.000000   1046.000000
50%       27.000000   1393.000000
75%       40.000000   2079.000000
max       54.000000   8359.000000

In [154]:
mask=df["Store"].isin([28,29,30]) | df["Store"].lt(5)
mask

0        False
1         True
2         True
3         True
4         True
         ...
83483    False
83484    False
83485    False
83486    False
83487    False
Name: Store, Length: 83488, dtype: bool

In [155]:
df[mask]

             Date  Store  Transactions
1      2013-01-02      1          2111
2      2013-01-02      2          2358
3      2013-01-02      3          3487
4      2013-01-02      4          1922
25     2013-01-02     28           950
...           ...    ...           ...
83436  2017-08-15      3          2956
83437  2017-08-15      4          1283
83461  2017-08-15     28          1343
83462  2017-08-15     29          1302
83463  2017-08-15     30           825

[10911 rows x 3 columns]

In [160]:
num=5
df.query("Store in [28,29,30] or Store<@num")

             Date  Store  Transactions
1      2013-01-02      1          2111
2      2013-01-02      2          2358
3      2013-01-02      3          3487
4      2013-01-02      4          1922
25     2013-01-02     28           950
...           ...    ...           ...
83436  2017-08-15      3          2956
83437  2017-08-15      4          1283
83461  2017-08-15     28          1343
83462  2017-08-15     29          1302
83463  2017-08-15     30           825

[10911 rows x 3 columns]